tutorials/heatTransfer/chtMultiRegionFoam/shellAndTubeHeatExchanger/0/tube/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/tube";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    lower
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    upper
    {
        type            fixedValue;
        value           $internalField;
    }
    wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
